{
  "preguntas": [
    {
      "pregunta": "驴Dentro de qu茅 elemento HTML ponemos el JavaScript?",
      "respuesta_correcta": "a",
      "opciones": {
        "a": "<script/>",
        "b": "<js/>",
        "c": "<javascript/>"
      },
      "explicacion": "El JavaScript se coloca dentro del elemento <script/>. Este elemento se utiliza para incrustar o referenciar c贸digo JavaScript en una p谩gina HTML."
    },
    {
      "pregunta": "驴Cu谩l es la sintaxis de JavaScript correcta para cambiar el contenido del elemento HTML a continuaci贸n?\n\n<p id=\"demo\">Esta es una demostraci贸n.</p>",
      "respuesta_correcta": "c",
      "opciones": {
        "a": "document.getElementByName('p').innerHTML = \"Hello World!\";",
        "b": "document.getElement('p').innerHTML = \"Hello World!\";",
        "c": "document.getElementById('demo').innerHTML = \"Hello World!\";"
      },
      "explicacion": "La sintaxis correcta para cambiar el contenido de un elemento HTML utilizando JavaScript es mediante el uso de la funci贸n document.getElementById() para obtener el elemento por su identificador (en este caso 'demo'), y luego acceder a su propiedad innerHTML para modificar su contenido."
    },
    {
      "pregunta": "驴D贸nde est谩 el lugar correcto para insertar un JavaScript?",
      "respuesta_correcta": "c",
      "opciones": {
        "a": "Es mejor dentro del <body>",
        "b": "Es mejor en el <head>",
        "c": "En ambos lugares es funcional"
      },
      "explicacion": "JavaScript se puede insertar tanto dentro del elemento <body> como en el <head> de un documento HTML. Colocarlo en el <head> es 煤til cuando se necesita cargar el c贸digo antes de que se renderice el contenido de la p谩gina. Colocarlo dentro del <body> es 煤til cuando se necesita acceder a elementos HTML espec铆ficos antes de que se cargue el resto de la p谩gina."
    },
    {
      "pregunta": "驴Cu谩l es la sintaxis correcta para referirse a un script externo llamado \"xxx.js\"?",
      "respuesta_correcta": "c",
      "opciones": {
        "a": "<script href=\"xxx.js\"/>",
        "b": "<script name=\"xxx.js\"/>",
        "c": "<script src=\"xxx.js\"/>"
      },
      "explicacion": "La sintaxis correcta para referirse a un script externo en JavaScript es utilizando el atributo 'src' dentro del elemento <script>. Por lo tanto, se utiliza la opci贸n '<script src=\"xxx.js\"/>' para referirse a un archivo JavaScript externo llamado 'xxx.js'."
    },
    {
      "pregunta": "驴C贸mo se escribe \"Hello World\" en un cuadro de alerta?",
      "respuesta_correcta": "b",
      "opciones": {
        "a": "msg(\"Hello World!\")",
        "b": "alert(\"Hello World!\")",
        "c": "show(\"Hello World!\")"
      },
      "explicacion": "Para mostrar un mensaje en un cuadro de alerta en JavaScript, se utiliza la funci贸n 'alert()' seguida del mensaje entre par茅ntesis. Por lo tanto, la opci贸n correcta es 'alert(\"Hello World!\")'."
    },
    {
      "pregunta": "驴C贸mo se crea una funci贸n en JavaScript?",
      "respuesta_correcta": "c",
      "opciones": {
        "a": "function:foo() { ... }",
        "b": "function = foo() { ... }",
        "c": "function foo() { ... } "
      },
      "explicacion": "Para crear una funci贸n en JavaScript, se utiliza la palabra clave 'function', seguida del nombre de la funci贸n y los par茅ntesis de apertura y cierre. La opci贸n correcta es 'function foo() { ... }', donde 'foo' es el nombre de la funci贸n."
    },
    {
      "pregunta": "驴C贸mo llamas a una funci贸n llamada \"foo\"?",
      "respuesta_correcta": "b",
      "opciones": {
        "a": "call function foo()",
        "b": "foo()",
        "c": "execute foo()"
      },
      "explicacion": "Para llamar a una funci贸n en JavaScript, se utiliza el nombre de la funci贸n seguido de par茅ntesis de apertura y cierre. Por lo tanto, para llamar a la funci贸n 'foo', se utiliza 'foo()'."
    },
    {
      "pregunta": "驴Qu茅 evento ocurre cuando el usuario hace clic en un elemento HTML?",
      "respuesta_correcta": "b",
      "opciones": {
        "a": "onmouseover",
        "b": "onclick",
        "c": "onaction"
      },
      "explicacion": "El evento que ocurre cuando el usuario hace clic en un elemento HTML es 'onclick'. Se puede utilizar para ejecutar c贸digo JavaScript cuando se produce un clic en el elemento."
    },
    {
      "pregunta": "驴JavaScript distingue entre may煤sculas y min煤sculas?",
      "respuesta_correcta": "a",
      "opciones": {
        "a": "Si",
        "b": "No",
        "c": "Talvez "
      },
      "explicacion": "JavaScript distingue entre may煤sculas y min煤sculas. Esto significa que 'Variable' y 'variable' se consideran dos identificadores diferentes en JavaScript."
    },
    {
      "pregunta": "驴Qu茅 convenci贸n de nombrado de variables se utiliza en JavaScript?",
      "respuesta_correcta": "c",
      "opciones": {
        "a": "Pascal case",
        "b": "Snake case",
        "c": "Camel case"
      },
      "explicacion": "En JavaScript, se utiliza la convenci贸n de nombrado de variables conocida como 'Camel case'. Esto implica que el nombre de una variable comienza con una letra min煤scula, y cada palabra adicional dentro del nombre comienza con una letra may煤scula, sin espacios ni guiones."
    },
    {
      "pregunta": "驴Cu谩l de estas variables es de tipo no primitivo?",
      "respuesta_correcta": "b",
      "opciones": {
        "a": "let number = 10",
        "b": "let persona = { name : 'charlie' }",
        "c": "let string = \"una cadena\""
      },
      "explicacion": "La variable 'persona' es de tipo no primitivo. En JavaScript, los objetos, incluidos los objetos literales como '{ name: 'charlie' }', se consideran tipos no primitivos."
    },
    {
      "pregunta": "驴Qu茅 retorna el m茅todo 'split' aplicado en una cadena de caracteres?",
      "respuesta_correcta": "a",
      "opciones": {
        "a": "Regresa un array separando los elementos de la cadena de caracteres pasando un argumento de separaci贸n",
        "b": "Regresa un objeto indexado con cada parte de la cadena pasando un argumento de separaci贸n",
        "c": "El m茅todo split no existe en JavaScript"
      },
      "explicacion": "El m茅todo 'split' en JavaScript se utiliza para dividir una cadena de caracteres en un array de subcadenas utilizando un car谩cter de separaci贸n especificado. La opci贸n correcta es 'Regresa un array separando los elementos de la cadena de caracteres pasando un argumento de separaci贸n'."
    },
    {
      "pregunta": "驴Qu茅 retorna el siguiente bloque de c贸digo\n\nconst array = [1, 2, 3]\nconsole.log(array.at(-1))?",
      "respuesta_correcta": "b",
      "opciones": {
        "a": "undefined ya que accedemos a un 铆ndice incorrecto",
        "b": "retorna el 煤ltimo elemento",
        "c": "retorna el 煤ltimo elemento restando -1"
      },
      "explicacion": "El m茅todo 'at()' no existe en JavaScript. Sin embargo, si se quisiera obtener el 煤ltimo elemento de un array, se podr铆a utilizar la indexaci贸n negativa, donde '-1' representa el 煤ltimo elemento. Por lo tanto, la opci贸n correcta es 'retorna el 煤ltimo elemento'."
    },
    {
      "pregunta": "驴C贸mo podemos hacer un salto de l铆nea dentro de una cadena de caracteres?",
      "respuesta_correcta": "a",
      "opciones": {
        "a": "usando \\n",
        "b": "usando \\endl",
        "c": "usando \\newline"
      },
      "explicacion": "Para hacer un salto de l铆nea dentro de una cadena de caracteres en JavaScript, se utiliza la secuencia de escape '\\n'. Por lo tanto, la opci贸n correcta es 'usando \\n'."
    },
    {
      "pregunta": "驴Cu谩l es el resultado de la siguiente expresi贸n\n(true || false) && true?",
      "respuesta_correcta": "a",
      "opciones": {
        "a": "true",
        "b": "TypeError",
        "c": "false"
      },
      "explicacion": "La expresi贸n '(true || false) && true' eval煤a primero la operaci贸n de OR ('||'), que devuelve 'true' ya que uno de los operandos es verdadero. Luego, eval煤a la operaci贸n de AND ('&&'), donde 'true && true' tambi茅n devuelve 'true'. Por lo tanto, el resultado de la expresi贸n es 'true'."
    },
    {
      "pregunta": "驴Qui茅n es el creador de Java?",
      "respuesta_correcta": "c",
      "opciones": {
        "a": "Bill Gates",
        "b": "Linus Torvalds",
        "c": "James Gosling",
        "d": "Larry Page"
      },
      "explicacion": "El creador de Java es James Gosling. Es un reconocido cient铆fico de la computaci贸n y programador que lider贸 el equipo de desarrollo de Java en Sun Microsystems a principios de la d茅cada de 1990."
    },
    {
      "pregunta": "驴Qu茅 significa la abreviatura WWW?",
      "respuesta_correcta": "b",
      "opciones": {
        "a": "World Weather Watch",
        "b": "World Wide Web",
        "c": "World Wrestling War",
        "d": "Wacky Waving Walrus"
      },
      "explicacion": "La abreviatura WWW significa 'World Wide Web'. Es una colecci贸n de p谩ginas web y otros recursos relacionados, como hiperv铆nculos y sitios web, que se pueden acceder a trav茅s de Internet utilizando un navegador web."
    },
    {
      "pregunta": "驴Cual es el lenguaje de programacion en el cual la identaci贸n tiene un significado?",
      "respuesta_correcta": "b",
      "opciones": {
        "a": "java",
        "b": "python",
        "c": "c#"
      },
      "explicacion": "La indentaci贸n  en python sirve para delimitar la estructura permitiendo establecer bloques de c贸digo"
    },
    {
      "pregunta": "驴Cual es la manera correcta de tipar un numero entero en Java?",
      "respuesta_correcta": "b",
      "opciones": {
        "a": "int",
        "b": "String",
        "c": "float"
      },
      "explicacion": "Por que String se usa para un tipo de dato en texto encerrado en comillas ('text') y float para un numero decimal(0.0)"
    },
    {
      "pregunta": "驴Que es una constante?",
      "respuesta_correcta": "c",
      "opciones": {
        "a": "un bloque de codigo",
        "b": "un bloque de codigo cuyos valores cambian",
        "c": "un bloque de codigo cuyos valores no cambian"
      },
      "explicacion": "las constantes son contenedores de valores que no cambian durante la ejecuci贸n del programa. Una vez que se ha asignado un valor a una constante, no se puede cambiar (Valor inmutable)."
    },
    {
      "pregunta": "驴El lenguaje de JavaScript es compilado o interpretado?",
      "respuesta_correcta": "b",
      "opciones": {
        "a": "compilado",
        "b": "interpretado"
      },
      "explicacion": "El c贸digo JavaScript es interpretado, es decir, directamente traducido a c贸digo de lenguaje de m谩quina subyacente mediante un motor de JavaScript."
    }
  ]
}
